# TextOrigin

## Description
Procedure TextOrigin is used to specify the origin point (location) of a newly created text object.&lt;BR&gt;
&lt;BR&gt;
The position of the actual text with respect to the origin is determined by the current vertical and horizontal text justification modes.&lt;BR&gt;
&lt;BR&gt;
&lt;DIV ALIGN = &quot;CENTER&quot;&gt;&lt;IMG SRC = &quot;../Graphics/textlocus.gif&quot; border = &quot;0&quot; &gt;&lt;/DIV&gt;

```pascal
PROCEDURE TextOrigin(p : REAL);
```

```python

def vs.TextOrigin(p):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|Coordinates of text origin.|

## See Also
VS Functions:
MoveTo

## Version
Availability: from MiniCAD
## Category
* Objects - Text